# -*- coding: utf-8 -*-
my_dict = {
    2: 'There are 5 fingers on a human hand.',
    5: '这是一个数字5。如果您有任何其他问题或需要进一步的解释，请告诉我。',
    4: '5（空格）这个数学表达式并不符合通常的运算规则，所以它没有明确的数学意义。如果你想表达某种特定的运算或关系，请提供更多的上下文或明确你的意图。\n\n如果你是想询问与5有关的数学问题，例如5的乘法口诀、5的倍数、5的因数等，请明确你的问题，我会尽力为你提供帮助。\n\n如果你是在尝试输入一个数学公式但输入错误，请重新检查并纠正错误，以确保你的数学表达式或公式是准确的。',
    1: '您好！看起来您可能只输入了一个数字 "5"，这可能不足以让我理解您的问题或需求。如果您需要帮助或有任何问题，请提供更多的信息或详细描述，这样我才能更好地协助您。',
    3: '您好！请问您需要了解关于数字5的哪方面信息？是想要了解它的数学属性、历史文化意义，还是其他方面的内容？如果能提供更具体的问题，我将能够更准确地为您提供帮助。'
}
# 访问键为3的值
result = my_dict[3]
print(result)
